In [1]:
import pandas as pd
import numpy as np
###Series
# I can assign indexes using pandas.

In [2]:
ser = pd.Series(np.random.rand(7),index=['a','b','c','d','e','f','g'],dtype=float)

In [3]:
ser

a    0.470392
b    0.490235
c    0.451909
d    0.775536
e    0.252954
f    0.727418
g    0.168440
dtype: float64

In [4]:
ser.values

array([ 0.47039216,  0.49023453,  0.45190864,  0.77553604,  0.25295375,
        0.72741784,  0.16843983])

In [5]:
db = {'US':'dollar','India':'rupee','UK':'euro'}

In [6]:
currSer=pd.Series(db)

In [7]:
currSer

India     rupee
UK         euro
US       dollar
dtype: object

In [8]:
currSer['UK']

'euro'

In [9]:
### Create Scalar Values for series
ser[:'c']

a    0.470392
b    0.490235
c    0.451909
dtype: float64

In [10]:
ser['c']=2222.0

In [11]:
np.mean(ser)

317.8407105939414

In [12]:
np.std(ser)

777.3698019947129

In [13]:
#DataFrames
#Analogous to series
#Mutable
#Heterogenous
stockSummaries={
'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88], 
        index=['Closing price','EPS',
                'Shares Outstanding(M)',
                'Beta', 'P/E','Market Cap(B)']),
    
'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
        index=['Closing price','EPS','Shares Outstanding(M)',
               'Beta','P/E','Market Cap(B)']),
'FB': pd.Series([61.48,0.59,2450,104.93,150.92], 
      index=['Closing price','EPS','Shares Outstanding(M)',
             'P/E', 'Market Cap(B)']),
'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36],
        index=['Closing price','EPS','Shares Outstanding(M)',
               'P/E','Beta', 'Market Cap(B)']),
'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
       index=['Closing price','EPS','Shares Outstanding(M)',
              'Market Cap(B)']), 
'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
       index=['Closing price','EPS','Shares Outstanding(M)','P/E',
              'Market Cap(B)','Beta'])}

In [14]:
stockSummaries

{'AAPL': Closing price            501.53
 EPS                       40.32
 Shares Outstanding(M)    892.45
 P/E                       12.44
 Market Cap(B)            447.59
 Beta                       0.84
 dtype: float64, 'AMZN': Closing price            346.15
 EPS                        0.59
 Shares Outstanding(M)    459.00
 Beta                       0.52
 P/E                      589.80
 Market Cap(B)            158.88
 dtype: float64, 'FB': Closing price              61.48
 EPS                         0.59
 Shares Outstanding(M)    2450.00
 P/E                       104.93
 Market Cap(B)             150.92
 dtype: float64, 'GOOG': Closing price            1133.43
 EPS                        36.05
 Shares Outstanding(M)     335.83
 Beta                        0.87
 P/E                        31.44
 Market Cap(B)             380.64
 dtype: float64, 'TWTR': Closing price             65.25
 EPS                       -0.30
 Shares Outstanding(M)    555.20
 Market Cap(B)             36.23
 dtype: float64, 'YHOO': Closing price              34.90
 EPS                         1.27
 Shares Outstanding(M)    1010.00
 P/E                        27.48
 Beta                        0.66
 Market Cap(B)              35.36
 dtype: float64}

In [15]:
stockDf=pd.DataFrame(stockSummaries)

In [16]:
stockDf

                         AAPL    AMZN       FB     GOOG    TWTR     YHOO
Beta                     0.84    0.52      NaN     0.87     NaN     0.66
Closing price          501.53  346.15    61.48  1133.43   65.25    34.90
EPS                     40.32    0.59     0.59    36.05   -0.30     1.27
Market Cap(B)          447.59  158.88   150.92   380.64   36.23    35.36
P/E                     12.44  589.80   104.93    31.44     NaN    27.48
Shares Outstanding(M)  892.45  459.00  2450.00   335.83  555.20  1010.00

In [17]:
stockDf[['AAPL']]

                         AAPL
Beta                     0.84
Closing price          501.53
EPS                     40.32
Market Cap(B)          447.59
P/E                     12.44
Shares Outstanding(M)  892.45

In [19]:
stockDf[['AAPL','FB']]

                         AAPL       FB
Beta                     0.84      NaN
Closing price          501.53    61.48
EPS                     40.32     0.59
Market Cap(B)          447.59   150.92
P/E                     12.44   104.93
Shares Outstanding(M)  892.45  2450.00

In [20]:
stockDf.T

      Beta  Closing price    EPS  Market Cap(B)     P/E  Shares Outstanding(M)
AAPL  0.84         501.53  40.32         447.59   12.44                 892.45
AMZN  0.52         346.15   0.59         158.88  589.80                 459.00
FB     NaN          61.48   0.59         150.92  104.93                2450.00
GOOG  0.87        1133.43  36.05         380.64   31.44                 335.83
TWTR   NaN          65.25  -0.30          36.23     NaN                 555.20
YHOO  0.66          34.90   1.27          35.36   27.48                1010.00

In [21]:
del stockDf['AAPL']

In [22]:
stockDf

                         AMZN       FB     GOOG    TWTR     YHOO
Beta                     0.52      NaN     0.87     NaN     0.66
Closing price          346.15    61.48  1133.43   65.25    34.90
EPS                      0.59     0.59    36.05   -0.30     1.27
Market Cap(B)          158.88   150.92   380.64   36.23    35.36
P/E                    589.80   104.93    31.44     NaN    27.48
Shares Outstanding(M)  459.00  2450.00   335.83  555.20  1010.00

In [23]:
stockDf['ZEKE'] = stockDf['GOOG'] + 100

In [24]:
stockDf

                         AMZN       FB     GOOG    TWTR     YHOO     ZEKE
Beta                     0.52      NaN     0.87     NaN     0.66   100.87
Closing price          346.15    61.48  1133.43   65.25    34.90  1233.43
EPS                      0.59     0.59    36.05   -0.30     1.27   136.05
Market Cap(B)          158.88   150.92   380.64   36.23    35.36   480.64
P/E                    589.80   104.93    31.44     NaN    27.48   131.44
Shares Outstanding(M)  459.00  2450.00   335.83  555.20  1010.00   435.83

In [29]:
ore1DF=pd.DataFrame(np.array([[20,35,25,20],
                              [11,28,32,29]]),
                    columns=['iron','magnesium',
                             'copper','silver'],
                    index=['a','b'])

In [30]:
ore1DF

   iron  magnesium  copper  silver
a    20         35      25      20
b    11         28      32      29

In [31]:
NYC_SnowAvgsData={'Months' :
['January','February','March', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [32]:
NYC_SnowAvgs_index=pd.DataFrame(NYC_SnowAvgsData,  
                          index= NYC_SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [33]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [34]:
SpotCrudePrices_2013_Data={
    'U.K. Brent' : {'2013-Q1':112.9, '2013-Q2':103.0, '2013-Q3':110.1, '2013-Q4':109.4},
    'Dubai':{'2013-Q1':108.1, '2013-Q2':100.8, '2013-Q3':106.1,'2013-Q4':106.7},
    'West Texas Intermediate':{'2013-Q1':94.4, '2013-Q2':94.2, '2013-Q3':105.8,'2013-Q4':97.4}}

In [35]:

dubaiPrices = pd.DataFrame.from_dict(SpotCrudePrices_2013_Data)

In [36]:
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [37]:
dubaiPrices.loc['2013-Q1']>109

Dubai                      False
U.K. Brent                  True
West Texas Intermediate    False
Name: 2013-Q1, dtype: bool

In [38]:
dubaiPrices.loc['2013-Q3']>100

Dubai                      True
U.K. Brent                 True
West Texas Intermediate    True
Name: 2013-Q3, dtype: bool

In [46]:
dubaiPrices[dubaiPrices.loc['2013-Q4']>90,:]

TypeError: 'Series' objects are mutable, thus they cannot be hashed

In [47]:
dubaiPrices.iloc[1:,2:]

         West Texas Intermediate
2013-Q2                     94.2
2013-Q3                    105.8
2013-Q4                     97.4

In [48]:
#Accessing by Index id
dubaiPrices.iat[3,0]

106.7

In [49]:
dubaiPrices.at['2013-Q4','Dubai']

106.7

In [50]:
stock_data = pd.read_csv('MoreStock.csv')

In [51]:
stock_data

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [52]:
stock_data[stock_data['PriceType']=='close']

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
1   2014/02/21     close  4263.41  1836.25       1164.63
4   2014/02/24     close  4292.97  1847.61       1174.55
7   2014/02/25     close  4287.59  1845.12       1173.95
10  2014/02/26     close  4292.06  1845.16       1181.72
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [53]:
stock_data[stock_data['PriceType']=='close']

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
1   2014/02/21     close  4263.41  1836.25       1164.63
4   2014/02/24     close  4292.97  1847.61       1174.55
7   2014/02/25     close  4287.59  1845.12       1173.95
10  2014/02/26     close  4292.06  1845.16       1181.72
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [58]:
import numpy as np
np.random.seed(100)
normDF=pd.DataFrame([[i for i in np.arange(5)] for j in np.arange(3)])

In [59]:
normDF

   0  1  2  3  4
0  0  1  2  3  4
1  0  1  2  3  4
2  0  1  2  3  4

In [57]:
stock_data.set_index('TradingDate',inplace=True)

In [61]:
stock_data.reset_index(inplace=True)